Autodesk.Revit.DB.IDuplicateTypeNamesHandler.OnDuplicateTypeNamesFound(Autodesk.Revit.DB.DuplicateTypeNamesHandlerArgs)
Called when the destination document contains types with the same names as the types being copied.
args:
The information about the types with duplicate names.
Returns:
The action to be taken: copy only types with unique names or cancel the operation.
Since:
2014

Autodesk.Revit.DB.IDuplicateTypeNamesHandler
An interface for custom handlers of duplicate type names encountered during a paste operation. When the destination document
contains types that have the same names as the types being copied, but different internals, a decision must be made on how to proceed - whether to
cancel the operation or continue, but only copy types with unique names.
Since:
2014